let questions = [//Массив вопросов с объектами под каждый вопрос
    {
        question: 'Как называется столица России',
        answers: 'а-Москва б-Вашингтон в-Берлин г-Токио',
        trueA: 'а'//Такой ключ везде используется как правильный ответ и сравнивается с ответом пользователя
    },
    {
        question: 'В каком году началась Первая мировая война',
        answers: 'а-1914 б-1917 в-1941 г-1939',
        trueA: 'а'
    },
    {
        question: 'Какую фамилию носила императорская династия России',
        answers: 'а-Рюрики б-Грозные в-Ивановы г-Романовы',
        trueA: 'г'
    }
]

alert('Выбрав вариант ответа, запомните букву, его обзначающую, для последующего ввода в качестве ответа')
for (let i = 0; i <= questions.length; i++){//поочередно перебираем все объекты в массиве вопросов
    if (i === questions.length){//длина массива больше, чем i последнего вопроса, значит на все ответили - победа
        alert('Поздравляем! Вы миллионер!');
        break;
    }
    alert(questions[i].question);//выводим вопрос
    alert(questions[i].answers);//варианты ответов
    let userAnswer = prompt ('Введите букву с нужным вариантом ответа');
    if (userAnswer === questions[i].trueA) {//сравнение
        alert('Правильно!');
    } else {//сравнение
        alert(`Ошибка! Пройдено этапов: ${i} из ${questions.length}`);
        break;
    }
}

/*Не знаю, на сколько я правильно понял, как должна была выглядеть эта игра, но
* получилось примерно так, хотя много чего можно и улучшить*/