//Задание  1
var Tc = 20;
var Tf = (9/5)*Tc+32;
alert (Tf);

//Задание 2
var name = "Василий";
var admin = name;
alert (admin);
/*При выполнении этого задания встроенная в phpstorm проверка выдала
предупреждение о том, что переменная admin является избыточной (что логично,
ведь можно обойтись без нее при таком алгоритме) - насколько часто допускается
использование таких "избыточных" переменных? Или же в действителном коде их, все же,
устраняют?
 */


//Задание 3
var a = 1000;
var b = '108';
alert(a+b);
/*Выводит 1000108, поскольку оператор + во взаимодействии
со строковым типом данных ('108') возвращает объединение двух строк
 */

/* Задание 4
https://learn.javascript.ru/script-async-defer
Теперь понятно, почему при добавлении js-скрипта в середину html-документа
на курсе Профессиональной верстки возникли проблемы с обработкой страницы
 */

